Database_Devops/docs/day8_loadtest_health.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        uvicorn
Server Hostname:        localhost
Server Port:            8000

Document Path:          /health
Document Length:        77 bytes

Concurrency Level:      20
Time taken for tests:   2.420 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      110500 bytes
HTML transferred:       38500 bytes
Requests per second:    206.65 [#/sec] (mean)
Time per request:       96.784 [ms] (mean)
Time per request:       4.839 [ms] (mean, across all concurrent requests)
Transfer rate:          44.60 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.3      0      20
Processing:    20   93  33.9     88     233
Waiting:       19   83  31.6     77     199
Total:         22   94  33.3     89     233

Percentage of the requests served within a certain time (ms)
  50%     89
  66%    102
  75%    110
  80%    116
  90%    128
  95%    158
  98%    200
  99%    204
 100%    233 (longest request)