Database_Devops/docs/day8_loadtest_lessons.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        uvicorn
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/lessons
Document Length:        22 bytes

Concurrency Level:      10
Time taken for tests:   0.611 seconds
Complete requests:      200
Failed requests:        0
Non-2xx responses:      200
Total transferred:      34600 bytes
HTML transferred:       4400 bytes
Requests per second:    327.52 [#/sec] (mean)
Time per request:       30.532 [ms] (mean)
Time per request:       3.053 [ms] (mean, across all concurrent requests)
Transfer rate:          55.33 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   3.5      0      18
Processing:     6   28   9.9     26      63
Waiting:        4   22   9.2     21      62
Total:          7   30   9.2     28      63

Percentage of the requests served within a certain time (ms)
  50%     28
  66%     31
  75%     34
  80%     36
  90%     42
  95%     48
  98%     56
  99%     63
 100%     63 (longest request)